In [1]:
import pandas as pd
import numpy as np

In [5]:
d = {
    'NO':[11,22,33,88,44,55,88,99,11,22,33,88,44,55,88,99],
    'ID': [1,2,3,4,8,5,8,9,1,2,3,4,8,5,8,9],
    'NAME': [111,888,222,333,444,555,888,999,111,888,222,333,444,555,888,999],
    'SCORE': [1111,8888,2222,3333,4444,5555,8888,9999,1111,8888,2222,3333,4444,5555,8888,9999],
}

dd = {
    'ID':[1,2,6,3,4,5,6,7],
    'NO1': [10,20,50,30,40,50,50,60],
    'NAME': [100,200,300,500,400,500,500,600],
    'SCORE': [1000,2000,3000,5000,4000,5000,5000,6000],
}

In [6]:
df1 = pd.DataFrame(data=d)
df2 = pd.DataFrame(data=dd)

In [7]:
df1,df2

(    NO  ID  NAME  SCORE
 0   11   1   111   1111
 1   22   2   888   8888
 2   33   3   222   2222
 3   88   4   333   3333
 4   44   8   444   4444
 5   55   5   555   5555
 6   88   8   888   8888
 7   99   9   999   9999
 8   11   1   111   1111
 9   22   2   888   8888
 10  33   3   222   2222
 11  88   4   333   3333
 12  44   8   444   4444
 13  55   5   555   5555
 14  88   8   888   8888
 15  99   9   999   9999,
    ID  NO1  NAME  SCORE
 0   1   10   100   1000
 1   2   20   200   2000
 2   6   50   300   3000
 3   3   30   500   5000
 4   4   40   400   4000
 5   5   50   500   5000
 6   6   50   500   5000
 7   7   60   600   6000)

In [10]:
groups = df1.groupby('NAME')

In [11]:
groups

In [20]:
for x,y in groups:
    print(x)

    print(y)
    print(' ')
    print(' ')

111
   NO  ID  NAME  SCORE
0  11   1   111   1111
8  11   1   111   1111


222
    NO  ID  NAME  SCORE
2   33   3   222   2222
10  33   3   222   2222


333
    NO  ID  NAME  SCORE
3   88   4   333   3333
11  88   4   333   3333


444
    NO  ID  NAME  SCORE
4   44   8   444   4444
12  44   8   444   4444


555
    NO  ID  NAME  SCORE
5   55   5   555   5555
13  55   5   555   5555


888
    NO  ID  NAME  SCORE
1   22   2   888   8888
6   88   8   888   8888
9   22   2   888   8888
14  88   8   888   8888


999
    NO  ID  NAME  SCORE
7   99   9   999   9999
15  99   9   999   9999

In [25]:
groups.get_group(111)

   NO  ID  NAME  SCORE
0  11   1   111   1111
8  11   1   111   1111

In [27]:
groups.min()

      NO  ID  SCORE
NAME
111   11   1   1111
222   33   3   2222
333   88   4   3333
444   44   8   4444
555   55   5   5555
888   22   2   8888
999   99   9   9999

In [31]:
groups.max()

      NO  ID  SCORE
NAME
111   11   1   1111
222   33   3   2222
333   88   4   3333
444   44   8   4444
555   55   5   5555
888   88   8   8888
999   99   9   9999

In [32]:
groups.mean()

        NO   ID   SCORE
NAME
111   11.0  1.0  1111.0
222   33.0  3.0  2222.0
333   88.0  4.0  3333.0
444   44.0  8.0  4444.0
555   55.0  5.0  5555.0
888   55.0  5.0  8888.0
999   99.0  9.0  9999.0

In [33]:
l = list(groups)

In [34]:
l

[(111,
     NO  ID  NAME  SCORE
  0  11   1   111   1111
  8  11   1   111   1111),
 (222,
      NO  ID  NAME  SCORE
  2   33   3   222   2222
  10  33   3   222   2222),
 (333,
      NO  ID  NAME  SCORE
  3   88   4   333   3333
  11  88   4   333   3333),
 (444,
      NO  ID  NAME  SCORE
  4   44   8   444   4444
  12  44   8   444   4444),
 (555,
      NO  ID  NAME  SCORE
  5   55   5   555   5555
  13  55   5   555   5555),
 (888,
      NO  ID  NAME  SCORE
  1   22   2   888   8888
  6   88   8   888   8888
  9   22   2   888   8888
  14  88   8   888   8888),
 (999,
      NO  ID  NAME  SCORE
  7   99   9   999   9999
  15  99   9   999   9999)]